API/stressTests/getAnswers.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 60
      arrivalRate: 1000
      name: Warm up
    # - duration: 60
    #   arrivalRate: 25
    #   rampTo: 75
    #   name: Ramp up load
    # - duration: 60
    #   arrivalRate: 1000
    #   name: Sustained load
  defaults:
    timeout: 20000
    headers:
      content-type: "application/json"
scenarios:
  - name: "Get Answers"
    flow:
      - get:
          url: "/qa/questions/{{$randomNumber(200, 1000000)}}/answers"